package com.github.dongglin.smart.spring.boot.plus.common.enums;

public enum StatusCode implements IResponseEnum {
    CODE_UNDEFINED(-1, "未指定异常细分状态码"),
    CODE_000000(0, "成功"),
    CODE_999999(999999, "系统错误"),
    CODE_777777(777777, "业务逻辑错误"),
    CODE_555555(555555, "数据库操作错误"),
    CODE_100000(100000, "注册配置错误"),
    CODE_100001(100001, "未能获取有效的上下文处理器"),
    CODE_100002(100002, "未能获取有效的上下文"),
    CODE_100003(100003, "JSON转换器未实现"),
    CODE_100004(100004, "指定的配置文件加载失败"),
    CODE_100005(100005, "配置文件属性无法正常读取"),
    CODE_100006(100006, "重置的侦听器集合不可以为空"),
    CODE_100007(100007, "注册的侦听器不可以为空"),
    CODE_200000(200000, "token错误"),
    CODE_200001(200001, "未能读取到有效Token"),
    CODE_200002(200002, "Token无效"),
    CODE_200003(200003, "Token已过期"),
    CODE_200004(200004, "Token已被顶下线"),
    CODE_200005(200005, "Token已被踢下线"),
    CODE_200006(200006, "Token已被冻结"),
    CODE_200007(200007, "前端Token提交格式错误"),
    CODE_200008(200008, "Token签名错误"),
    CODE_200009(200009, "当前账号未通过服务封禁校验"),
    CODE_200010(200010, "提供要解禁的账号无效"),
    CODE_300000(300000, "数据校验失败"),
    CODE_300001(300001, "实体类不能为空"),
    CODE_300002(300002, "数据类型转换错误"),
    CODE_300003(300003, "请求中缺少参数"),
    CODE_300004(300004, "参数校验异常"),
    CODE_300005(300005, "非法参数"),
    CODE_400000(400000, "非法操作"),
    CODE_400001(400001, "没有权限操作"),
    CODE_400002(400002, "服务不可用"),
    CODE_400003(400003, "服务熔断"),
    CODE_400004(400004, "服务故障"),
    CODE_400005(400005, "没有该服务"),
    CODE_400006(400006, "服务路由异常"),
    CODE_400007(400007, "服务调用权限不够"),
    CODE_400008(400008, "重复操作"),
    CODE_500000(500000, "编码解码加解密异常"),
    CODE_500001(500001, "Base64编码异常"),
    CODE_500002(500002, "Base64解码异常"),
    CODE_500003(500003, "JSON编码异常"),
    CODE_500004(500004, "JSON解码异常"),
    CODE_500005(500005, "URL编码异常"),
    CODE_500006(500006, "URL解码异常"),
    CODE_500007(500007, "md5加密异常"),
    CODE_500008(500008, "sha1加密异常"),
    CODE_500009(500009, "sha256加密异常"),
    CODE_500010(500010, "AES加密异常"),
    CODE_500011(500011, "AES解密异常"),
    CODE_500012(500012, "RSA公钥加密异常"),
    CODE_500013(500013, "RSA公钥解密异常"),
    CODE_500014(500014, "RSA公钥解密异常"),
    CODE_500015(500015, "RSA私钥解密异常"),
    CODE_500016(500016, "RSA私钥解密异常"),
    CODE_600000(600001, "Java代码生成异常"),
    CODE_600001(600002, "Java代码编译异常");

    private int code;
    private String message;

    private StatusCode(int code, String message) {
        this.code = code;
        this.message = message;
    }

    @Override
    public int getCode() {
        return code;
    }

    @Override
    public String getMessage() {
        return message;
    }
}
